This notebook is for the resolution of the ML project

*Importing the data

In [1]:
import pandas as pd

In [3]:
df = pd.read_csv('nat2022.csv', sep=';')
df.head()

   sexe        preusuel annais  nombre
0     1  _PRENOMS_RARES   1900    1249
1     1  _PRENOMS_RARES   1901    1342
2     1  _PRENOMS_RARES   1902    1330
3     1  _PRENOMS_RARES   1903    1286
4     1  _PRENOMS_RARES   1904    1430

*start of data cleaning

In [4]:
#renaming columns
df.columns = ["sex", "name", "year", 'count']
df.head()

   sex            name  year  count
0    1  _PRENOMS_RARES  1900   1249
1    1  _PRENOMS_RARES  1901   1342
2    1  _PRENOMS_RARES  1902   1330
3    1  _PRENOMS_RARES  1903   1286
4    1  _PRENOMS_RARES  1904   1430

In [7]:
#exclude all _PRENOMS_RARES
df = df[df['name'] != '_PRENOMS_RARES']
df.head()

     sex   name  year  count
123    1      A  1980      3
124    1      A  1998      3
125    1      A  XXXX     21
126    1  AADAM  2009      4
127    1  AADAM  2014      3

In [11]:
#regroup all the name while ignoring sex
df = df.groupby(['name', 'year'])['count'].sum().reset_index()
df.head()

    name  year  count
0      A  1980      3
1      A  1998      3
2      A  XXXX     21
3  AADAM  2009      4
4  AADAM  2014      3

In [15]:
# delete all rows that have a non-numeric value in the year column
df = df[df['year'].str.isnumeric()]
df.head()

    name  year  count
0      A  1980      3
1      A  1998      3
3  AADAM  2009      4
4  AADAM  2014      3
5  AADAM  2015      3

In [23]:
#change type of year column to int
df['year'] = df['year'].astype(int)
df.head()

    name  year  count
0      A  1980      3
1      A  1998      3
3  AADAM  2009      4
4  AADAM  2014      3
5  AADAM  2015      3

In [ ]:
# sort by year and name
df = df.sort_values(['year', 'name'])
df.head()

         name  year  count
5196    ABDON  1900      4
6378     ABEL  1900    428
6528  ABELINE  1900      3
6571   ABELLE  1900      3
7646  ABRAHAM  1900     19

*Regrouping similar names by using Levenshtein distance